## Plan Result (prod_enterprise - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 18 to add, 12 to change, 24 to destroy.</code></pre>

* Create
  * module.environment[&#34;demo&#34;].time_rotating.one_year
  * module.environment[&#34;dev&#34;].time_rotating.one_year
  * module.environment[&#34;ithc&#34;].time_rotating.one_year
  * module.environment[&#34;prod&#34;].time_rotating.one_year
  * module.environment[&#34;ptl&#34;].time_rotating.one_year
  * module.environment[&#34;ptlsbox&#34;].time_rotating.one_year
  * module.environment[&#34;sbox&#34;].time_rotating.one_year
  * module.environment[&#34;stg&#34;].time_rotating.one_year
  * module.environment[&#34;test&#34;].time_rotating.one_year
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;Platform-NonProd&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;Platform-Sandbox&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;SDS-Sandbox&#34;]
  * module.environment[&#34;demo&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;dev&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;ithc&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;prod&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;ptl&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;ptlsbox&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;sbox&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;stg&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;test&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
* Delete
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_subscription.this
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_subscription.this
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_subscription.this
* Replace
  * module.environment[&#34;demo&#34;].azuread_application_password.token
  * module.environment[&#34;dev&#34;].azuread_application_password.token
  * module.environment[&#34;ithc&#34;].azuread_application_password.token
  * module.environment[&#34;prod&#34;].azuread_application_password.token
  * module.environment[&#34;ptl&#34;].azuread_application_password.token
  * module.environment[&#34;ptlsbox&#34;].azuread_application_password.token
  * module.environment[&#34;sbox&#34;].azuread_application_password.token
  * module.environment[&#34;stg&#34;].azuread_application_password.token
  * module.environment[&#34;test&#34;].azuread_application_password.token




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_management_group.level_3["Platform-NonProd"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/Platform-NonProd"
        name                       = "Platform-NonProd"
      ~ subscription_ids           = [
          - "b50cfb90-d6cd-4e78-97e6-cb7958335b6e",
          - "ba3c6fcf-22b1-4a11-9080-1cf965c060e9",
            # (3 unchanged elements hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["Platform-Sandbox"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
        name                       = "Platform-Sandbox"
      ~ subscription_ids           = [
          - "5709598c-3a1c-4535-8979-f10948b9a031",
            # (4 unchanged elements hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["SDS-Sandbox"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
        name                       = "SDS-Sandbox"
      ~ subscription_ids           = [
          - "0c1744f8-9e63-4742-9c28-c066fd2e6eee",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.environment["demo"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2025-10-20T07:09:05.184255Z" -> (known after apply)
      ~ id                  = "fcc63c4d-d347-4e4f-b32e-81643079b27d/password/555a5b67-dd4a-4325-8704-931370f53378" -> (known after apply)
      ~ key_id              = "555a5b67-dd4a-4325-8704-931370f53378" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2023-10-06T07:05:47Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2023-10-20T07:09:05.184255Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["demo"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "08221f14-fdee-45ea-8c95-846ec325b992"
        # (10 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["demo"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.environment["dev"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2025-10-27T07:06:43.6453746Z" -> (known after apply)
      ~ id                  = "5f463690-f80e-4284-bb35-0b7c2cd014c3/password/488f5c5e-341a-49cf-95dd-fb3fadaee222" -> (known after apply)
      ~ key_id              = "488f5c5e-341a-49cf-95dd-fb3fadaee222" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2023-10-06T07:05:47Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2023-10-27T07:06:43.6453746Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["dev"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "73cabb79-5119-490a-b589-cfd227539ca5"
        # (10 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["dev"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.environment["ithc"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2025-10-20T07:09:49.3821277Z" -> (known after apply)
      ~ id                  = "cae18304-2c43-46af-86e8-926702c344b4/password/d3d001a4-1022-46ff-9ef6-05300d8fbb8a" -> (known after apply)
      ~ key_id              = "d3d001a4-1022-46ff-9ef6-05300d8fbb8a" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2023-10-06T07:05:47Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2023-10-20T07:09:49.3821277Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["ithc"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "a2bfb279-4595-4969-9f77-b729bd45bf0f"
        # (10 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["ithc"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.environment["prod"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2025-10-20T07:09:05.1089393Z" -> (known after apply)
      ~ id                  = "9c149b18-7537-4b03-9093-641191faee0b/password/ef5660c6-5efa-4f10-8c9e-e157c124c89b" -> (known after apply)
      ~ key_id              = "ef5660c6-5efa-4f10-8c9e-e157c124c89b" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2023-10-06T07:05:47Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2023-10-20T07:09:05.1089393Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["prod"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "1a18e2d8-b36f-40e7-872b-6045dd48be30"
        # (10 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["prod"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.environment["ptl"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2025-10-20T07:09:05.0959134Z" -> (known after apply)
      ~ id                  = "d4eb8008-5914-47d3-a21a-fd89f4c50b36/password/5063d748-b849-4b06-b91f-4e1e6da92e52" -> (known after apply)
      ~ key_id              = "5063d748-b849-4b06-b91f-4e1e6da92e52" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2023-10-06T07:05:47Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2023-10-20T07:09:05.0959134Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["ptl"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "03bb29ba-af78-4fb2-9e23-1eca3afb3b6e"
        # (10 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["ptl"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.environment["ptlsbox"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2025-10-20T07:09:09.9177263Z" -> (known after apply)
      ~ id                  = "3fdcf12a-6a2c-46fc-be16-71510f849748/password/acc27a66-c7bf-4bfd-bfdf-0fdb2ebdc6dd" -> (known after apply)
      ~ key_id              = "acc27a66-c7bf-4bfd-bfdf-0fdb2ebdc6dd" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2023-10-06T07:05:47Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2023-10-20T07:09:09.9177263Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["ptlsbox"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "b13822df-6271-4119-947a-174055ca8c0a"
        # (10 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["ptlsbox"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.environment["sbox"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2025-10-20T07:09:09.9008021Z" -> (known after apply)
      ~ id                  = "acc21fed-cca3-4b72-ae8a-73bac29b976e/password/719a8e29-91fd-4581-9231-f0d8337774a7" -> (known after apply)
      ~ key_id              = "719a8e29-91fd-4581-9231-f0d8337774a7" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2023-10-06T07:05:47Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2023-10-20T07:09:09.9008021Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["sbox"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "e006bad5-f598-4230-9d83-c4c0ba5314f8"
        # (10 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["sbox"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.environment["stg"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2025-10-20T07:09:09.8972846Z" -> (known after apply)
      ~ id                  = "0765b073-cc02-4287-ba01-4a8dff3e1a93/password/4f6c33df-23e3-4107-8e6a-1cd7e3fb03bc" -> (known after apply)
      ~ key_id              = "4f6c33df-23e3-4107-8e6a-1cd7e3fb03bc" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2023-10-06T07:05:47Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2023-10-20T07:09:09.8972846Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["stg"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "3b5f78c8-1728-47aa-890f-2f251c34d7eb"
        # (10 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["stg"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.environment["test"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2025-10-27T07:06:43.635482Z" -> (known after apply)
      ~ id                  = "90950051-fbb1-40e5-aede-b661a736c1ef/password/301a36f5-7b71-4fbc-b18c-c7086197b407" -> (known after apply)
      ~ key_id              = "301a36f5-7b71-4fbc-b18c-c7086197b407" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2023-10-06T07:05:47Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2023-10-27T07:06:43.635482Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["test"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "16857e89-9ec3-437b-a7e6-d8aac8839122"
        # (10 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["test"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.subscription["DCD-MI-SBOX"].azurerm_subscription.this will be destroyed
  # (because module.subscription["DCD-MI-SBOX"] is not in configuration)
  - resource "azurerm_subscription" "this" {
      - alias             = "DCD-MI-SBOX" -> null
      - billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705" -> null
      - id                = "/providers/Microsoft.Subscription/aliases/DCD-MI-SBOX" -> null
      - subscription_id   = "0c1744f8-9e63-4742-9c28-c066fd2e6eee" -> null
      - subscription_name = "DCD-MI-SBOX" -> null
      - tags              = {} -> null
      - tenant_id         = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids    = [] -> null
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "Grants aks cluster admin permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name               = "DTS AKS Administrators (sub:dts-management-sbox)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "/groups/cf13cae2-da9c-4219-a5af-8ec197064a41" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "0e62ed21-25b6-46f3-bb13-1008a2a7c45b" -> null
      - members                    = [] -> null
      - object_id                  = "cf13cae2-da9c-4219-a5af-8ec197064a41" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [] -> null
      - prevent_duplicate_names    = true -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null
      - writeback_enabled          = false -> null

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids    = [] -> null
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "Grants aks cluster user permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name               = "DTS AKS Users (sub:dts-management-sbox)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "/groups/9390da56-b5ae-4aba-995a-c682f2e1d763" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "4ba2e462-dcaf-4821-9303-e65cb2d35ae6" -> null
      - members                    = [] -> null
      - object_id                  = "9390da56-b5ae-4aba-995a-c682f2e1d763" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [] -> null
      - prevent_duplicate_names    = true -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null
      - writeback_enabled          = false -> null

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Contributor"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids    = [] -> null
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "Grants contributor permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name               = "DTS Contributors (sub:dts-management-sbox)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "/groups/90ac3da9-9ae7-4849-8a49-e2fe903dd223" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "4c58b0d9-2f3c-4207-b69f-e9847a19b69f" -> null
      - members                    = [
          - "89f89bfe-3183-4d01-868c-29f7303580d9",
        ] -> null
      - object_id                  = "90ac3da9-9ae7-4849-8a49-e2fe903dd223" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [] -> null
      - prevent_duplicate_names    = true -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null
      - writeback_enabled          = false -> null

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Key Vault Administrator"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids    = [] -> null
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "Grants key vault administrator permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name               = "DTS Key Vault Administrators (sub:dts-management-sbox)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "/groups/ec9b048f-bd1f-4f23-b320-ef8259abd188" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "6a6c045c-b" -> null
      - members                    = [] -> null
      - object_id                  = "ec9b048f-bd1f-4f23-b320-ef8259abd188" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [
          - "0ec60e03-4262-44ce-abcf-83e2131c9207",
        ] -> null
      - prevent_duplicate_names    = true -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null
      - writeback_enabled          = false -> null
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Owner"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids    = [] -> null
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "Grants owner permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name               = "DTS Owners (sub:dts-management-sbox)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "/groups/89f89bfe-3183-4d01-868c-29f7303580d9" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "2f447054-25e3-477e-a926-2e2e6478ee4b" -> null
      - members                    = [] -> null
      - object_id                  = "89f89bfe-3183-4d01-868c-29f7303580d9" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [] -> null
      - prevent_duplicate_names    = true -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null
      - writeback_enabled          = false -> null

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Reader"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids    = [] -> null
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "Grants reader permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name               = "DTS Readers (sub:dts-management-sbox)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "/groups/99e37c67-ca37-4922-9b32-f1db7b7acefe" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "8d705cdd-eaff-43c1-b420-31089f5a917e" -> null
      - members                    = [] -> null
      - object_id                  = "99e37c67-ca37-4922-9b32-f1db7b7acefe" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [] -> null
      - prevent_duplicate_names    = true -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null
      - writeback_enabled          = false -> null

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Security Reader"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids    = [] -> null
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "Grants security reader permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name               = "DTS Security Readers (sub:dts-management-sbox)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "/groups/07acdc23-a6b1-4db9-a38e-0a41e2159e08" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "0d648d86-2" -> null
      - members                    = [] -> null
      - object_id                  = "07acdc23-a6b1-4db9-a38e-0a41e2159e08" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [
          - "0ec60e03-4262-44ce-abcf-83e2131c9207",
        ] -> null
      - prevent_duplicate_names    = true -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null
      - writeback_enabled          = false -> null
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Storage Blob Data Reader"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids    = [] -> null
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "Grants storage blob data contributor permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name               = "DTS Blob Readers (sub:dts-management-sbox)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "/groups/d0a28f71-5f71-42e6-aaaf-1cacb1ec67f5" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "a4ee6c9b-bd68-1b5c-f5c5-9297ad25b500" -> null
      - members                    = [] -> null
      - object_id                  = "d0a28f71-5f71-42e6-aaaf-1cacb1ec67f5" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [] -> null
      - prevent_duplicate_names    = true -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null
      - writeback_enabled          = false -> null

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azurerm_key_vault.kv will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azurerm_key_vault" "kv" {
      - access_policy                   = [
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "7a620133-7346-4291-b7fe-8d69e1cfc356"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                ]
              - object_id               = "a7ade81c-aa77-4bd3-9146-ef448c86c855"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "dad693c4-36ad-468f-94e9-76faa4bc844b"
              - secret_permissions      = [
                  - "Get",
                  - "Set",
                  - "List",
                  - "Delete",
                  - "Restore",
                  - "Recover",
                  - "Backup",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "0e6b530c-57aa-4fa3-8352-bad1dfe05884"
              - secret_permissions      = [
                  - "List",
                  - "Get",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "0ec60e03-4262-44ce-abcf-83e2131c9207"
              - secret_permissions      = [
                  - "List",
                  - "Set",
                  - "Get",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "b7947e2c-012f-4859-ad94-fdc5cfd5c007"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "c86c7f91-62c6-412b-bc35-fdfdfa941b9f"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ] -> null
      - enable_rbac_authorization       = false -> null
      - enabled_for_deployment          = false -> null
      - enabled_for_disk_encryption     = false -> null
      - enabled_for_template_deployment = false -> null
      - id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c5709598cf10948b9a031kv" -> null
      - location                        = "uksouth" -> null
      - name                            = "c5709598cf10948b9a031kv" -> null
      - public_network_access_enabled   = true -> null
      - purge_protection_enabled        = false -> null
      - resource_group_name             = "azure-control-sbox-rg" -> null
      - sku_name                        = "standard" -> null
      - soft_delete_retention_days      = 90 -> null
      - tags                            = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-enterprise"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
          - "startupMode"  = "always"
        } -> null
      - tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
      - vault_uri                       = "https://c5709598cf10948b9a031kv.vault.azure.net/" -> null

      - network_acls {
          - bypass                     = "AzureServices" -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azurerm_role_assignment.local_role_assignments["User Access Administrator"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azurerm_role_assignment" "local_role_assignments" {
      - id                   = "/subscriptions/5709598c-3a1c-4535-8979-f10948b9a031/providers/Microsoft.Authorization/roleAssignments/a10adf68-2de5-aba0-f189-796e8f0c5df3" -> null
      - name                 = "a10adf68-2de5-aba0-f189-796e8f0c5df3" -> null
      - principal_id         = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/5709598c-3a1c-4535-8979-f10948b9a031/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9" -> null
      - role_definition_name = "User Access Administrator" -> null
      - scope                = "/subscriptions/5709598c-3a1c-4535-8979-f10948b9a031" -> null

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azurerm_storage_account.sa will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azurerm_storage_account" "sa" {
      - access_tier                       = "Hot" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "ZRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = false -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - dns_endpoint_type                 = "Standard" -> null
      - enable_https_traffic_only         = true -> null
      - https_traffic_only_enabled        = true -> null
      - id                                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/c5709598cf10948b9a031sa" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = false -> null
      - large_file_share_enabled          = false -> null
      - local_user_enabled                = true -> null
      - location                          = "uksouth" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "c5709598cf10948b9a031sa" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_endpoint             = "https://c5709598cf10948b9a031sa.blob.core.windows.net/" -> null
      - primary_blob_host                 = "c5709598cf10948b9a031sa.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_dfs_endpoint              = "https://c5709598cf10948b9a031sa.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "c5709598cf10948b9a031sa.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://c5709598cf10948b9a031sa.file.core.windows.net/" -> null
      - primary_file_host                 = "c5709598cf10948b9a031sa.file.core.windows.net" -> null
      - primary_location                  = "uksouth" -> null
      - primary_queue_endpoint            = "https://c5709598cf10948b9a031sa.queue.core.windows.net/" -> null
      - primary_queue_host                = "c5709598cf10948b9a031sa.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://c5709598cf10948b9a031sa.table.core.windows.net/" -> null
      - primary_table_host                = "c5709598cf10948b9a031sa.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://c5709598cf10948b9a031sa.z33.web.core.windows.net/" -> null
      - primary_web_host                  = "c5709598cf10948b9a031sa.z33.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "azure-control-sbox-rg" -> null
      - secondary_access_key              = (sensitive value) -> null
      - secondary_connection_string       = (sensitive value) -> null
      - sftp_enabled                      = false -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-enterprise"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
          - "startupMode"  = "always"
        } -> null

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = true -> null

          - delete_retention_policy {
              - days                     = 30 -> null
              - permanent_delete_enabled = false -> null
            }
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/providers/Microsoft.Security/datascanners/StorageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
        }
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azurerm_subscription.this will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azurerm_subscription" "this" {
      - alias             = "DTS-MANAGEMENT-SBOX" -> null
      - billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705" -> null
      - id                = "/providers/Microsoft.Subscription/aliases/DTS-MANAGEMENT-SBOX" -> null
      - subscription_id   = "5709598c-3a1c-4535-8979-f10948b9a031" -> null
      - subscription_name = "DTS-MANAGEMENT-SBOX" -> null
      - tags              = {} -> null
      - tenant_id         = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null

      - timeouts {}
    }

  # module.subscription["HMCTS-HUB-DEV"].azurerm_subscription.this will be destroyed
  # (because module.subscription["HMCTS-HUB-DEV"] is not in configuration)
  - resource "azurerm_subscription" "this" {
      - alias             = "HMCTS-HUB-DEV" -> null
      - billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705" -> null
      - id                = "/providers/Microsoft.Subscription/aliases/HMCTS-HUB-DEV" -> null
      - subscription_id   = "b50cfb90-d6cd-4e78-97e6-cb7958335b6e" -> null
      - subscription_name = "HMCTS-HUB-DEV" -> null
      - tags              = {} -> null
      - tenant_id         = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null

      - timeouts {}
    }

  # module.subscription["HMCTS-HUB-TEST"].azurerm_subscription.this will be destroyed
  # (because module.subscription["HMCTS-HUB-TEST"] is not in configuration)
  - resource "azurerm_subscription" "this" {
      - alias             = "HMCTS-HUB-TEST" -> null
      - billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705" -> null
      - id                = "/providers/Microsoft.Subscription/aliases/HMCTS-HUB-TEST" -> null
      - subscription_id   = "ba3c6fcf-22b1-4a11-9080-1cf965c060e9" -> null
      - subscription_name = "HMCTS-HUB-TEST" -> null
      - tags              = {} -> null
      - tenant_id         = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null

      - timeouts {}
    }

Plan: 18 to add, 12 to change, 24 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.environment["demo"].time_rotating.one_year has been deleted
  - resource "time_rotating" "one_year" {
      - id               = "2023-10-06T07:05:47Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.environment["dev"].time_rotating.one_year has been deleted
  - resource "time_rotating" "one_year" {
      - id               = "2023-10-06T07:05:47Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.environment["ithc"].time_rotating.one_year has been deleted
  - resource "time_rotating" "one_year" {
      - id               = "2023-10-06T07:05:47Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.environment["prod"].time_rotating.one_year has been deleted
  - resource "time_rotating" "one_year" {
      - id               = "2023-10-06T07:05:47Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.environment["ptl"].time_rotating.one_year has been deleted
  - resource "time_rotating" "one_year" {
      - id               = "2023-10-06T07:05:47Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.environment["ptlsbox"].time_rotating.one_year has been deleted
  - resource "time_rotating" "one_year" {
      - id               = "2023-10-06T07:05:47Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.environment["sbox"].time_rotating.one_year has been deleted
  - resource "time_rotating" "one_year" {
      - id               = "2023-10-06T07:05:47Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.environment["stg"].time_rotating.one_year has been deleted
  - resource "time_rotating" "one_year" {
      - id               = "2023-10-06T07:05:47Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.environment["test"].time_rotating.one_year has been deleted
  - resource "time_rotating" "one_year" {
      - id               = "2023-10-06T07:05:47Z" -> null
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":115,"Program":"tfcmt","SHA1":"","Target":"prod_enterprise - TerraformPlanApply","Vars":{}} -->